In [5]:
#1
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
df.to_csv("titanic.csv")

In [7]:
#2
data = {
        'A':[3,8,6,2,9],
        'B':[5,2,9,3,1],
        'C':[1,7,4,5,2]
        }
df1 = pd.DataFrame(data)
df1.head()

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [8]:
df1.shape

(5, 3)

In [9]:
new_index = pd.RangeIndex(start=0, stop=2*df1.shape[0]+1, step=2)
df1 = df1.reindex(new_index)

In [10]:
df1.head()

     A    B    C
0  3.0  5.0  1.0
2  6.0  9.0  4.0
4  9.0  1.0  2.0
6  NaN  NaN  NaN
8  NaN  NaN  NaN

In [11]:
#3
data2 = {'Values':[10,20,30,40,50]}
df2 = pd.DataFrame(data2)
df2.head()

   Values
0      10
1      20
2      30
3      40
4      50

In [12]:
df2.iloc[0:3].sum()

Values    60
dtype: int64

In [13]:
#4
data3 = {'Text': ['This is sentence', 'Another sentence with more words', 'Only one']}
df3 = pd.DataFrame(data3)
df3['Word_Count'] = df3['Text'].apply(lambda x: len(x.split()))
print(df3)

                               Text  Word_Count
0                  This is sentence           3
1  Another sentence with more words           5
2                          Only one           2

In [14]:
#5
'''DataFrame.size() - returns the no.of.elements in a dataframe
    DataFrame.shape() - returns the tuple of no.of.rows,no.of.columns'''

'DataFrame.size() - returns the no.of.elements in a dataframe\n    DataFrame.shape() - returns the tuple of no.of.rows,no.of.columns'

In [15]:
#6
'''
pd.read_excel() is used to read an excel file
'''

'\npd.read_excel() is used to read an excel file\n'

In [16]:
#7
data4 = {'Email': ['charan@gmail.com', 'ck@yahoo.com', 'kumar@gmail.com']}
df4 = pd.DataFrame(data4)
df4['Username'] = df4['Email'].apply(lambda x: x.split('@')[0])
print(df4)

              Email Username
0  charan@gmail.com   charan
1      ck@yahoo.com       ck
2   kumar@gmail.com    kumar

In [17]:
#8
data5 = {
        'A':[3,8,6,2,9],
        'B':[5,2,9,3,1],
        'C':[1,7,4,5,2]
        }
df5 = pd.DataFrame(data5)
df5.head()

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [18]:
df5[(df5['A'] > 5 )& (df5['B'] < 10)].iloc[0:5:2]

   A  B  C
1  8  2  7
4  9  1  2

In [19]:
#9
data6 = {'Values':[10,20,30,40,50]}
df6 = pd.DataFrame(data6)
df6.head()

   Values
0      10
1      20
2      30
3      40
4      50

In [20]:
print("Mean: ",df6['Values'].mean())
print("Median: ",df6['Values'].median())
print("Standard Deviation: ",df6['Values'].std())

Mean:  30.0
Median:  30.0
Standard Deviation:  15.811388300841896

In [14]:
#10
data7 = {'Date': pd.date_range(start='2022-01-01', periods=10),
        'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]}
df7 = pd.DataFrame(data7)
df7['Moving Average'] = df7['Sales'].rolling(window=7).mean()
print(df7)

        Date  Sales  Moving Average
0 2022-01-01     10             NaN
1 2022-01-02     20            15.0
2 2022-01-03     30            20.0
3 2022-01-04     40            25.0
4 2022-01-05     50            30.0
5 2022-01-06     60            35.0
6 2022-01-07     70            40.0
7 2022-01-08     80            50.0
8 2022-01-09     90            60.0
9 2022-01-10    100            70.0

In [53]:
#11
data8 = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03','2023-01-04','2023-01-05']
}
df8 = pd.DataFrame(data8)
df8['Date'] = pd.to_datetime(df8['Date'])
df8.head()

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [54]:
df8['Weekday'] = df8['Date'].dt.day_name()
df8.head()

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [56]:
#12
data9 = {
    'Date': ['2023-01-01', '2023-01-15', '2023-01-31', '2023-02-15']
}
df9 = pd.DataFrame(data9)
df9.head()

         Date
0  2023-01-01
1  2023-01-15
2  2023-01-31
3  2023-02-15

In [60]:
df9[(df9['Date'] >= '2023-01-01') & (df9['Date'] <= '2023-01-31') ]

         Date
0  2023-01-01
1  2023-01-15
2  2023-01-31

In [ ]:
#13
'''
import pandas
'''